       IDENTIFICATION DIVISION.
           PROGRAM-ID. "HELLOWOLRD".
       PROCEDURE DIVISION.
           DISPLAY "BONJOUR THOMAS ET EWEN!".
           STOP RUN.
